package assignment.chap02;

public class Operator {
    static void main() {
        /* 실습문제 1
        두 개의 정수형 변수를 선언하고, 삼항 연산자를 사용하여
        두 수 중 큰 수를 출력하는 프로그램을 작성해본다.
        출력예시
        두 수 중 큰 수는 20입니다. */

        int num1 = 10;
        int num2 = 20;
        System.out.println("두 수 중 큰 수는 " + (num1 > num2 ? num1 : num2) + "입니다.");

        /* 실습문제 2
        정수형 변수를 선언하여 점수를 저장하고,
        삼항 연산자를 사용하여 점수가 60점 이상이면 “합격입니다”,
        그렇지 않으면 “아쉽지만 불합격입니다.” 을 출력하는 프로그램을 작성해본다.
        출력예시
        합격입니다~~!!!
        또는 아쉽지만 불합격입니다…. */
        int num3 = 60;
        if (num3 >= 60) {
            System.out.println("합격입니다~~!!!");
        } else {
            System.out.println("아쉽지만 불합격입니다...");
        }

        /* 실습문제 3
        정수형 변수를 선언하고, 삼항연산자를 사용하여
        입력된 수가 짝수인지 홀수인지 출력하는 프로그램을 작성해본다.
        참고사항 : 조건식에 %를 활용하여 짝수인지 홀수인지를 판단해 보세요~~
        출력예시
        입력하신 수는 짝수입니다.
        또는 입력하신 수는 홀수입니다. */
        int num4 = 101;
        if (num4 % 2 == 0) {
            System.out.println("입력하신 수는 짝수입니다.");
        } else {
            System.out.println("입력하신 수는 홀수입니다.");
        }

        /* 실습문제 4
        실수를 변수로 선언하여 점수를 저장하고, 이를 정수로 변환하여
        점수가 90점 이상이면 ”A”,
        80점 이상이면 “B”,
        70점 이상이면 “C”,
        60점 이상이면”D
        60점 미만이면 “F”를 출력하는 프로그램을 작성해본다.
        출력예시
        홍길동의 이번 점수등급은 B입니다. */
        double dob = 80;
        if (dob >= 90) {
            System.out.println("홍길동의 이번 점수등급은 " + 'A' + "입니다.");
        } else if (dob >= 80) {
            System.out.println("홍길동의 이번 점수등급은 " + 'B' + "입니다.");
        } else if (dob >= 70) {
            System.out.println("홍길동의 이번 점수등급은 " + 'C' + "입니다.");
        } else if (dob >= 60) {
            System.out.println("홍길동의 이번 점수등급은 " + 'D' + "입니다.");
        } else {
            System.out.println("홍길동의 이번 점수등급은 " + 'F' + "입니다.");
        }

        /* 실습문제 5
        정수형 변수를 두개 선언하여 회원의 월(month)과 일(day)를 저장합니다.
        월이 1월부터 6월까지이면서, 일이 1일부터 15일까지인 경우 “배민 쿠폰”을,
        월이 7월부터 12월까지이면서, 일이 16일부터 31일까지인 경우 “스타벅스 커피”를
        그 외의 경우는 “사탕”이 선물로 선택되는 프로그램을 작성해본다.
        출력예시
        “본인이름”의 선물은 스타벅스 커피 입니다.
        또는 “본인이름”의 선물은 사탕 입니다. */
        int month = 8;
        int day = 20;

        if (month <= 6 && month > 0 && day <= 15 && day > 0) {
            System.out.println("강민기의 선물은 배민 쿠폰입니다.");
        } else if (month <= 12 && month > 6 && day >= 16 && day <= 31) {
            System.out.println("강민기님의 선물은 스타벅스 커피입니다.");
        } else {
            System.out.println("강민기님의 선물은 사탕입니다.");
        }
    }
}
